Revit 2027 API
DisplacementElement.GetChildren Method
 Returns a set of DisplacementElements which have this DisplacementElement as a parent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<DisplacementElement> GetChildren()
Public Function GetChildren As IList(Of DisplacementElement)
public:
IList<DisplacementElement^>^ GetChildren()
member GetChildren : unit -> IList<DisplacementElement>
Return Value
IList<DisplacementElement>
 The returned array is sorted by element id.
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace